## Plan Result (demo_frontdoor)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pre-portal&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo"
        name                                 = "sdshmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-darts-portal" -> "healthProbeSettings-pre-portal"
            id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/backendPools/darts-portal"
          ~ load_balancing_name = "loadBalancingSettings-darts-portal" -> "loadBalancingSettings-pre-portal"
          ~ name                = "darts-portal" -> "pre-portal"

          ~ backend {
              ~ host_header = "darts-portal.demo.platform.hmcts.net" -> "pre-portal.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/healthProbeSettings/healthProbeSettings-darts-portal"
          ~ name                = "healthProbeSettings-darts-portal" -> "healthProbeSettings-pre-portal"
            # (5 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = false
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-darts-portal"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/loadBalancingSettings/loadBalancingSettings-darts-portal"
          ~ name                            = "loadBalancingSettings-darts-portal" -> "loadBalancingSettings-pre-portal"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-darts-portal"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "darts-portal.demo.platform.hmcts.net" -> "pre-portal.demo.platform.hmcts.net"
            id                                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/darts-portal"
          ~ name                                    = "darts-portal" -> "pre-portal"
          ~ web_application_firewall_policy_link_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportaldemo" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                               = "darts-portal.demo.platform.hmcts.net"
          + name                                    = "darts-portal"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportaldemo"
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "darts-portal",
              + "pre-portal",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/darts-portal"
          ~ name               = "darts-portal" -> "pre-portal"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "darts-portal" -> "pre-portal"
              ~ cache_enabled                         = true -> false
              ~ cache_query_parameter_strip_directive = "StripNone" -> "StripAll"
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "darts-portal",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "darts-portal"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "darts-portal"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal-demo",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/portal-demoHttpsRedirect"
          ~ name               = "portal-demoHttpsRedirect" -> "sds-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "toffee",
              + "portal-demo",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "portal-demoHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pip-frontend",
              + "toffee",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/pip-frontendHttpsRedirect"
          ~ name               = "pip-frontendHttpsRedirect" -> "toffeeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "c100-application",
              + "pip-frontend",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/c100-applicationHttpsRedirect"
          ~ name               = "c100-applicationHttpsRedirect" -> "pip-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-admin-web",
              + "c100-application",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/vh-admin-webHttpsRedirect"
          ~ name               = "vh-admin-webHttpsRedirect" -> "c100-applicationHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-test-web",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/vh-test-webHttpsRedirect"
          ~ name               = "vh-test-webHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web",
              + "vh-test-web",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/vh-video-webHttpsRedirect"
          ~ name               = "vh-video-webHttpsRedirect" -> "vh-test-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "darts-portal",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/routingRules/darts-portalHttpsRedirect"
          ~ name               = "darts-portalHttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pre-portal",
            ]
          + name               = "pre-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (46 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pre-portal"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/sdshmcts-demo/frontendEndpoints/pre-portal"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pre-portal"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "preportaldemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "CountryMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "GB",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "GeoMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932115"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942450"
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":534,"Program":"tfcmt","SHA1":"","Target":"demo_frontdoor","Vars":{}} -->